In [ ]:
import pyodbc
import pandas as pd

In [ ]:
#dados_conexao_oracle = cx_Oracle.connect(user="NOME_BASE_DADOS", password="SENHA_BASE_DADOS", dsn="HOST:PORT/SERVICE_NAME",encoding="UTF-8")

In [ ]:
#pyodbc.drivers()

['SQL Server',
 'Microsoft Access Driver (*.mdb, *.accdb)',
 'Microsoft Excel Driver (*.xls, *.xlsx, *.xlsm, *.xlsb)',
 'Microsoft Access Text Driver (*.txt, *.csv)',
 'Amazon Redshift (x64)']

In [ ]:
dados_conexao = ("DRIVER={Amazon Redshift (x64)};"
                     "Server=xxxxxxxxxxxxxxxxxxxxxxx;"
                     "Database=xxxxxxxxxx;"
                     "UID=xxxxxxxxxx;"
                     "PWD=!;"
                     "Port=5439")

In [ ]:
conexao = pyodbc.connect(dados_conexao)
print('Conexão Bem Sucedida')

Conexão Bem Sucedida

In [ ]:
df_class_city = pd.read_sql_query('select * from datamart.xxxxx', conexao)

In [ ]:
df_class_city

,idt_class_city,cod_zip_code_finish,cod_zip_code_start,des_class_city,dat_import_utc
0,1,1099999,1000000,Capital,2022-03-23 11:31:18
1,3,1999999,1400000,Capital,2022-03-23 11:31:28
2,6,3399999,3000000,Capital,2022-03-23 11:31:28
3,8,4999999,4000000,Capital,2022-03-23 11:31:28
4,11,6299999,6000000,RM,2022-03-23 11:31:28
...,...,...,...,...,...
5569,5566,99939999,99930000,Interior,2022-03-23 11:35:46
5570,5567,99949999,99940000,Interior,2022-03-23 11:35:46
5571,5570,99964999,99960000,Interior,2022-03-23 11:35:46
5572,5572,99979999,99970000,Interior,2022-03-23 11:35:46
5573,5574,99999999,99990000,Interior,2022-03-23 11:35:47